{
	"_meta": {
		"sources": [
			{
				"json": "DnD52Pitangueiras",
				"abbreviation": "DnD52P",
				"full": "D&D 5.2 Pitangueiras",
				"url": "https://github.com/thecrowbr/DnD51Pitangueiras",
				"authors": [
					"TheCrow"
				],
				"convertedBy": [
					"TheCrow"
				],
				"version": "unknown"
			}
		],
		"dateAdded": 1620268448,
		"dateLastModified": 1620268448
	},
	"subclassFeature": [
		{
			"name": "Testando",
			"source": "PHB",
			"page": 97,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Testando",
			"subclassSource": "PHB",
			"level": 3,
			"entries": [
				"Some rogues enhance their fine-honed skills of stealth and agility with magic, learning tricks of enchantment and illusion. These rogues include pickpockets and burglars, but also pranksters, mischief-makers, and a significant number of adventurers.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Spellcasting|Rogue||Testando||3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Mage Hand Legerdemain|Rogue||Testando||3"
				}
			]
		},
		{
			"name": "Mage Hand Legerdemain",
			"source": "PHB",
			"page": 97,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Testando",
			"subclassSource": "PHB",
			"level": 3,
			"header": 1,
			"entries": [
				"Starting at 3rd level, when you cast {@spell mage hand}, you can make the spectral hand {@condition invisible}, and you can perform the following additional tasks with it:",
				{
					"type": "list",
					"items": [
						"You can stow one object the hand is holding in a container worn or carried by another creature.",
						"You can retrieve an object in a container worn or carried by another creature.",
						"You can use {@item thieves' tools|phb} to pick locks and disarm traps at range."
					]
				},
				"You can perform one of these tasks without being noticed by a creature if you succeed on a Dexterity ({@skill Sleight of Hand}) check contested by the creature's Wisdom ({@skill Perception}) check.",
				"In addition, you can use the bonus action granted by your Cunning Action to control the hand."
			]
		},
		{
			"name": "Spellcasting",
			"source": "PHB",
			"page": 97,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Testando",
			"subclassSource": "PHB",
			"level": 3,
			"header": 1,
			"entries": [
				"When you reach 3rd level, you gain the ability to cast spells. See {@book chapter 10|PHB|10} for the general rules of spellcasting and {@book chapter 11|PHB|11} for the {@filter wizard spell list|spells|class=wizard}.",
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"name": "Cantrips",
							"entries": [
								"You learn three cantrips: {@spell mage hand} and two other cantrips of your choice from the wizard spell list. You learn another wizard cantrip of your choice at 10th level."
							]
						}
					]
				},
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"name": "Spell Slots",
							"entries": [
								"The Testando Spellcasting table shows how many spell slots you have to cast your {@filter wizard spells|spells|class=wizard} of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
								"For example, if you know the 1st-level spell {@spell charm person} and have a 1st-level and a 2nd-level spell slot available, you can cast {@spell charm person} using either slot."
							]
						}
					]
				},
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"name": "Spells Known of 1st-Level and Higher",
							"entries": [
								"You know three 1st-level wizard spells of your choice, two of which you must choose from the enchantment and illusion spells on the wizard spell list.",
								"The Spells Known column of the Testando Spellcasting table shows when you learn more wizard spells of 1st level or higher. Each of these spells must be an enchantment or illusion spell of your choice, and must be of a level for which you have spell slots. For instance, when you reach 7th level in this class, you can learn one new spell of 1st or 2nd level.",
								"The spells you learn at 8th, 14th, and 20th level can come from any school of magic.",
								"Whenever you gain a level in this class, you can replace one of the wizard spells you know with another spell of your choice from the wizard spell list. The new spell must be of a level for which you have spell slots, and it must be an enchantment or illusion spell, unless you're replacing the spell you gained at 3rd, 8th, 14th, or 20th level from any school of magic."
							]
						}
					]
				},
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"name": "Spellcasting Ability",
							"entries": [
								"Intelligence is your spellcasting ability for your wizard spells, since you learn your spells through dedicated study and memorization. You use your Intelligence whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a wizard spell you cast and when making an attack roll with one.",
								{
									"type": "abilityDc",
									"name": "Spell",
									"attributes": [
										"int"
									]
								},
								{
									"type": "abilityAttackMod",
									"name": "Spell",
									"attributes": [
										"int"
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"name": "Magical Ambush",
			"source": "PHB",
			"page": 97,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Testando",
			"subclassSource": "PHB",
			"level": 9,
			"header": 2,
			"entries": [
				"Starting at 9th level, if you are hidden from a creature when you cast a spell on it, the creature has disadvantage on any saving throw it makes against the spell this turn."
			]
		},
		{
			"name": "Versatile Trickster",
			"source": "PHB",
			"page": 97,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Testando",
			"subclassSource": "PHB",
			"level": 13,
			"header": 2,
			"entries": [
				"At 13th level, you gain the ability to distract targets with your {@spell mage hand}. As a bonus action on your turn, you can designate a creature within 5 feet of the spectral hand created by the spell. Doing so gives you advantage on attack rolls against that creature until the end of the turn."
			]
		},
		{
			"name": "Spell Thief",
			"source": "PHB",
			"page": 97,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Testando",
			"subclassSource": "PHB",
			"level": 17,
			"header": 2,
			"entries": [
				"At 17th level, you gain the ability to magically steal the knowledge of how to cast a spell from another spellcaster.",
				"Immediately after a creature casts a spell that targets you or includes you in its area of effect, you can use your reaction to force the creature to make a saving throw with its spellcasting ability modifier. The DC equals your spell save DC. On a failed save, you negate the spell's effect against you, and you steal the knowledge of the spell if it is at least 1st level and of a level you can cast (it doesn't need to be a wizard spell). For the next 8 hours, you know the spell and can cast it using your spell slots. The creature can't cast that spell until the 8 hours have passed.",
				"Once you use this feature, you can't use it again until you finish a long rest."
			]
		}
	]
}
